Revit 2024 API
WireConduitTypeSet.ReverseIterator Method
Retrieve a backward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual WireConduitTypeSetIterator ReverseIterator()
Visual Basic
Public Overridable Function ReverseIterator As WireConduitTypeSetIterator
Visual C++
public:
virtual WireConduitTypeSetIterator^ ReverseIterator()
Return Value
Returns a backward moving iterator to the set.
See Also
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace